# LAB 04 - Data preprocessing 2

## 03 정렬, 필터링

연습문제 — 마케팅팀 신입사원의 첫 번째 미션
□ VIP 고객을 찾아라!

-  당신은 방금 우리 회사 마케팅팀에 입사한 신입사원입니다.
- 팀장님께서 당신에게 첫 번째 미션을 주셨습니다.
- 연말을 앞두어 VIP 고객들에게 감사의 마음을 담은 연하장을 보내려고 합니다.
- 당신의 임무는 제공된 고객 데이터 vip_customer를 분석하여 VIP 고객 후보 명단을 만드는 것입니다.

□ 아래의 조건들을 모두 만족하는 진정한 VIP 고객을 찾아내어, 그들의 명단을 팀장님께 보고해야 합니다.
1. 우수 고객:
총 구매액(TotalSpending)이 100,000원 이상인 고객

2. 활동적인 고객:
서울(City)에 거주하는 고객

□ 보고할 내용
✔ 위 세 가지 조건을 모두 만족하는 고객들을 총 구매액(TotalSpending)이 높은 순서대로 정렬하여 상위 5명의 고객 정보를 추출하세요.

✔ 추출된 5명의 고객 데이터에서 Name, City, TotalSpending 세 개의 열만 선택하여 최종 명단을 만드세요.

In [1]:
from hossam import load_data
import numpy as np
from pandas import DataFrame
from pandas import merge
from pandas import concat
from pandas import CategoricalDtype
from sklearn.impute import SimpleImputer

In [4]:
vip_customer = load_data('vip_customer')
vip_customer

[data] https://data.hossam.kr/data/lab04/vip_customer.xlsx
[desc] VIP 고객 목록 데이터

field             description
----------------  ----------------
CustomerID        고객번호
Name              고객명
Age               나이
City              거주지역
JoinDate          가입일
TotalSpending     총 지출액
LastPurchaseDate  마지막 구매 날짜

           Name  Age City   JoinDate  TotalSpending LastPurchaseDate
CustomerID
1001        김철수   35   서울 2022-01-15         150000       2023-11-01
1002        이영희   28   부산 2021-03-22          80000       2023-10-15
1003        박민준   42   서울 2022-07-10         250000       2023-11-10
1004        최지우   25   인천 2023-02-20          50000       2023-09-25
1005        정다솜   31   서울 2021-11-05         320000       2023-11-12
1006        윤현우   38   부산 2022-05-30         120000       2023-11-05
1007        강예진   29   서울 2023-01-15          85000       2023-10-22
1008        오승민   45   광주 2021-08-12         180000       2023-11-08
1009        한지민   27   서울 2022-10-01         450000       2023-11-15
1010        송서연   33   대전 2023-04-01          65000       2023-09-30
1011        임도윤   39   서울 2021-06-18         210000       2023-11-02
1012        장유나   26   부산 2023-03-10          40000       2023-08-15
1013        황재민   41   서울 2022-09-05         190000       2023-11-07
1014        신은경   30   대구 2021-12-20          95000       2023-10-18
1015        고은별   36   서울 2023-05-25         130000       2023-11-11

In [7]:
#1. 우수 고객:
# 총 구매액(TotalSpending)이 100,000원 이상인 고객

# 2. 활동적인 고객:
# 서울(City)에 거주하는 고객
# vup_customer


seoul_df = vip_customer.query("City == '서울' and TotalSpending >100000")
seoul_df

           Name  Age City   JoinDate  TotalSpending LastPurchaseDate
CustomerID
1001        김철수   35   서울 2022-01-15         150000       2023-11-01
1003        박민준   42   서울 2022-07-10         250000       2023-11-10
1005        정다솜   31   서울 2021-11-05         320000       2023-11-12
1009        한지민   27   서울 2022-10-01         450000       2023-11-15
1011        임도윤   39   서울 2021-06-18         210000       2023-11-02
1013        황재민   41   서울 2022-09-05         190000       2023-11-07
1015        고은별   36   서울 2023-05-25         130000       2023-11-11

In [ ]:
seoul_df_copy = seoul_df.copy()

seoul_df_copy_sorted = seoul_df_copy.sort_values('TotalSpending',ascending=False)
seoul_df_copy_sorted_top5 = seoul_df_copy_sorted.head()

           Name  Age City   JoinDate  TotalSpending LastPurchaseDate
CustomerID
1009        한지민   27   서울 2022-10-01         450000       2023-11-15
1005        정다솜   31   서울 2021-11-05         320000       2023-11-12
1003        박민준   42   서울 2022-07-10         250000       2023-11-10
1011        임도윤   39   서울 2021-06-18         210000       2023-11-02
1013        황재민   41   서울 2022-09-05         190000       2023-11-07

In [ ]:
seoul_df_copy_sorted_top5_final = seoul_df_copy_sorted_top5.filter(['Name','City','TotalSpending'])
seoul_df_copy_sorted_top5_final

           Name City  TotalSpending
CustomerID
1009        한지민   서울         450000
1005        정다솜   서울         320000
1003        박민준   서울         250000
1011        임도윤   서울         210000
1013        황재민   서울         190000